app/controllers/users_controller.rb

      def update
        respond_to do |format|
          if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "pedromoreno"], ["password", "1234"], ["updated_at", "2019-10-03 23:16:44.929981"], ["id", 12]]